app/controllers/events_controller.rb

SELECT "events".* FROM "events"
SELECT "events".* FROM "events" WHERE "events"."sport_type" IN ('Baseball', 'Other')
---
  def index
    @events = Event.all
    if params[:sport_types].present?
      @events = @events.where(sport_type: params[:sport_types])